{
  "week": "2026-01-12",
  "updated_by": "Agent System (Sarah, Marcus, Chloe)",
  "featured_videos": [
    {
      "video_id": "pe6mXWxTwcQ",
      "editorial_title": "Body Chemistry Shifts: What Actually Changes",
      "heat_badge": "🔥🔥 Trending",
      "commentary": "This hit 106K views because people want to know what carnivore actually does to your body beyond weight loss. Body odor, skin changes, digestion. Nobody warns you about these details, but everyone experiences them. The comment section turned into a support group with people sharing their own shifts. The \"ghost wipe\" phenomenon alone got 200+ likes. Real talk like this builds trust in the community.",
      "curator": "Chloe"
    },
    {
      "video_id": "Io5kdEdpK8c",
      "editorial_title": "Belly Fat Reality Check",
      "heat_badge": "🔥 Science",
      "commentary": "Belly fat isn't about calories or willpower. It's insulin resistance, metabolic dysfunction, and hormonal signaling gone sideways. Dr. Bright breaks down why the standard advice fails—you can't exercise your way out of insulin problems. Fix the metabolic foundation first. Everything else is noise until you address how your body processes energy.",
      "curator": "Sarah"
    },
    {
      "video_id": "q-aHpaBTXP4",
      "editorial_title": "Sue's Transformation Journey",
      "heat_badge": "🔥 Success Story",
      "commentary": "These personal stories matter. Sue shares her desperate moment—when standard approaches stopped working and she had to try something different. No Carb Life keeps bringing these testimonials because they show the human side of metabolic healing. Not just the before/after photos, but why someone finally decides to try carnivore in the first place.",
      "curator": "Chloe"
    },
    {
      "video_id": "TDau4k0qTlo",
      "editorial_title": "Mental Health Breakthrough with Carnivore",
      "heat_badge": "🔥🔥 Mental Health",
      "commentary": "A psychiatrist talking about diet and mental health—this crosses into territory most doctors avoid. Mental health conditions improve when you fix your metabolism. Depression, anxiety, brain fog—these aren't just \"chemical imbalances\" you fix with medication. Sarah's journey shows what happens when you stabilize blood sugar and remove inflammatory triggers. The brain runs on what you feed it.",
      "curator": "Sarah"
    },
    {
      "video_id": "7a1St4Ot3xA",
      "editorial_title": "Time for Change: Starting Your Journey",
      "heat_badge": "🔥 Motivation",
      "commentary": "Short, direct, no fluff. Coach Carnivore Cam keeps it simple: it's time for a change. Sometimes that's all people need to hear. The carnivore community loves these quick motivation hits between the longer educational content. 6,500 views on a short format means the message resonated. Action over analysis.",
      "curator": "Marcus"
    },
    {
      "video_id": "l9fLrqBPG0c",
      "editorial_title": "Carnivore Recipe: Blueberry White Chocolate",
      "heat_badge": "🔥 Recipe",
      "commentary": "Recipe content performs because people want variety without breaking their protocol. Blueberries are technically fruit, but some people include small amounts in their version of carnivore. This is \"carnivore-adjacent\"—useful for those who want flexibility. The practical content balances out the heavy science and testimonials. People need ideas for what to actually eat.",
      "curator": "Sarah"
    }
  ]
}
