{
  "slug": "2026-01-12-animal-based-debate",
  "title": "The Animal-Based Debate: Is Paul Saladino Right About Honey and Fruit?",
  "date": "January 12, 2026",
  "author": "Carnivore Weekly",
  "description": "Carnivore vs animal-based breakdown. Paul Saladino's honey and fruit argument, strict carnivore counterpoints, what the community actually experiences, and how to decide which protocol works for you.",
  "content_html": "<div class=\"post-content\">\n\n<p>Okay, so Paul Saladino is all over your feed talking about honey, fruit, and raw milk. He used to be hardcore carnivore. Now he's calling it \"animal-based\" and adding carbs back in.</p>\n<p>And you're wondering: <strong>Did he betray the movement? Or did he figure something out that strict carnivores are missing?</strong></p>\n<div class=\"tldr-box\">\n<h3>TL;DR</h3>\n<ul>\n<li><strong>Paul Saladino's argument</strong>—active people may do better with honey and fruit; carbs aren't inherently bad, processed food is</li>\n<li><strong>Strict carnivore argument</strong>—you don't need carbs if you're fat-adapted; honey and fruit are still sugar</li>\n<li><strong>The real answer</strong>—it depends on your goals, activity level, and how you personally respond</li>\n<li><strong>How to decide</strong>—start strict for 90 days, then test if needed. Your body will tell you.</li>\n</ul>\n</div>\n<p>This debate is raging in the community right now. Let's break down both sides and what people are actually experiencing.</p>\n<!-- Debate Comparison -->\n<div class=\"debate-grid\">\n<div class=\"debate-side animal-based\">\n<div class=\"debate-content\">\n<h4>Core Arguments:</h4>\n<ul>\n<li>Carbs aren't bad—processed food and seed oils are the problem</li>\n<li>Active people need glycogen for performance</li>\n<li>Honey and fruit are \"clean\" carbs humans evolved eating</li>\n<li>Zero-carb can cause electrolyte issues</li>\n</ul>\n<div class=\"debate-protocol\">\n<strong>Protocol:</strong>\n                                    Meat, organs, fruit, honey, raw dairy. No grains, no seed oils, no processed food.\n                                </div>\n</div>\n</div>\n<div class=\"debate-side strict-carnivore\">\n<div class=\"debate-content\">\n<h4>Core Arguments:</h4>\n<ul>\n<li>You don't need carbs—humans are fat-adapted</li>\n<li>Honey and fruit are still sugar (fructose = liver load)</li>\n<li>Elimination works by eliminating everything</li>\n<li>Adding carbs back reintroduces potential triggers</li>\n</ul>\n<div class=\"debate-protocol\">\n<strong>Protocol:</strong>\n                                    Meat, water, salt. Maybe eggs and dairy if tolerated. No plants, no exceptions.\n                                </div>\n</div>\n</div>\n</div>\n<!-- Paul's Arguments -->\n<div class=\"argument-card\">\n<h2>What Paul Saladino Actually Says</h2>\n<div class=\"argument-list\">\n<div class=\"argument-item\">\n<span class=\"argument-number\">1</span>\n<div class=\"argument-content\">\n<h4>Carbs aren't inherently bad</h4>\n<p>The problem with the Standard American Diet isn't carbs—it's industrial foods. Honey and fruit are \"clean\" carbs that humans have eaten for thousands of years.</p>\n</div>\n</div>\n<div class=\"argument-item\">\n<span class=\"argument-number\">2</span>\n<div class=\"argument-content\">\n<h4>Active people perform better with carbs</h4>\n<p>Athletes, people who do intense exercise, and people with high stress might perform better with some glucose. Honey and fruit provide that without the downsides of grains.</p>\n</div>\n</div>\n<div class=\"argument-item\">\n<span class=\"argument-number\">3</span>\n<div class=\"argument-content\">\n<h4>Electrolyte balance is easier with carbs</h4>\n<p>Zero-carb carnivore can cause low aldosterone, which messes with sodium retention. Adding carbs helps your body hold onto electrolytes better.</p>\n</div>\n</div>\n</div>\n</div>\n<blockquote class=\"pull-quote\">\n                        \"The debate isn't really about science. It's about individual response. Some people thrive on zero-carb. Some people do better with a little fruit. Both can work.\"\n                    </blockquote>\n<!-- Strict Carnivore Arguments -->\n<div class=\"argument-card\">\n<h2>What Strict Carnivores Say</h2>\n<div class=\"argument-list\">\n<div class=\"argument-item\">\n<span class=\"argument-number\">1</span>\n<div class=\"argument-content\">\n<h4>You don't need carbs—humans are fat-adapted</h4>\n<p>Once you're fat-adapted (usually 3-6 months in), your body runs on fat and ketones. Your liver makes what little glucose you need via gluconeogenesis.</p>\n</div>\n</div>\n<div class=\"argument-item\">\n<span class=\"argument-number\">2</span>\n<div class=\"argument-content\">\n<h4>Honey and fruit are still sugar</h4>\n<p>Fructose from fruit goes straight to your liver and can cause the same metabolic issues as table sugar if you eat too much. Honey is basically glucose and fructose. It's not magic.</p>\n</div>\n</div>\n<div class=\"argument-item\">\n<span class=\"argument-number\">3</span>\n<div class=\"argument-content\">\n<h4>Elimination works because you eliminate everything</h4>\n<p>A lot of people come to carnivore because they have autoimmune issues, gut problems, or inflammation. Strict carnivore removes all potential triggers. Adding fruit back might reintroduce problems.</p>\n</div>\n</div>\n</div>\n</div>\n<!-- Inline Image -->\n<figure class=\"inline-image\">\n<img alt=\"Quality butter for carnivore diet\" loading=\"lazy\" sizes=\"(max-width: 600px) 400px, (max-width: 1000px) 800px, 1200px\" src=\"../images/butter-block-800w.webp\" srcset=\"../images/butter-block-400w.webp 400w,\n                                     ../images/butter-block-800w.webp 800w,\n                                     ../images/butter-block-1200w.webp 1200w\"/>\n<figcaption>Fat-based energy—the strict carnivore's fuel source</figcaption>\n</figure>\n<!-- Community Experience -->\n<div class=\"experience-section\">\n<h2>What the Community Actually Experiences</h2>\n<p>I've been watching this debate play out on Reddit, YouTube, and Discord for months. Here's what people are saying:</p>\n<div class=\"experience-grid\">\n<div class=\"experience-group strict\">\n<h4>✓ Better on Strict Carnivore (zero-carb)</h4>\n<div class=\"experience-quotes\">\n<div class=\"experience-quote\">\"I tried adding honey back in and my skin broke out again. Strict carnivore keeps me clear.\"</div>\n<div class=\"experience-quote\">\"Carbs make me hungry. Zero-carb keeps my appetite stable.\"</div>\n<div class=\"experience-quote\">\"I came to carnivore to heal my gut. Adding fruit gave me bloating again.\"</div>\n<div class=\"experience-quote\">\"I feel mentally sharper on zero-carb. Ketones are better brain fuel for me.\"</div>\n</div>\n</div>\n<div class=\"experience-group animal-based\">\n<h4>🍯 Better on Animal-Based (with carbs)</h4>\n<div class=\"experience-quotes\">\n<div class=\"experience-quote\">\"I do CrossFit 5 days a week. Adding honey pre-workout gave me my performance back.\"</div>\n<div class=\"experience-quote\">\"Zero-carb made me feel flat and low-energy. A little fruit fixed it.\"</div>\n<div class=\"experience-quote\">\"I was getting insomnia and heart palpitations on strict carnivore. Adding carbs fixed my electrolytes.\"</div>\n<div class=\"experience-quote\">\"I'm a woman and zero-carb tanked my hormones. Adding fruit brought my cycle back.\"</div>\n</div>\n</div>\n</div>\n<p style=\"margin-top: 20px;\"><strong>Both groups exist. Both are telling the truth about their own experience.</strong></p>\n</div>\n<!-- Who Benefits -->\n<h2>Who Benefits from Each Protocol</h2>\n<div class=\"who-grid\">\n<div class=\"who-box add-carbs\">\n<h3>🍯 Consider Adding Carbs If:</h3>\n<ul>\n<li><strong>Athletes and highly active people</strong> — Intense training depletes glycogen. Honey or fruit can top off stores without processed carbs.</li>\n<li><strong>Women with hormonal issues</strong> — Some women report better cycle regularity and thyroid function with carbs.</li>\n<li><strong>Electrolyte struggles</strong> — If you get heart palpitations, dizziness, or insomnia despite supplementing salt, carbs might help retention.</li>\n<li><strong>Very lean before starting</strong> — If you don't have much body fat to burn, carbs can provide quick energy.</li>\n</ul>\n</div>\n<div class=\"who-box stay-strict\">\n<h3>✓ Stay Strict Carnivore If:</h3>\n<ul>\n<li><strong>Autoimmune conditions</strong> — Elimination works because you eliminate everything. Adding plants back can reintroduce triggers.</li>\n<li><strong>Insulin resistance or diabetes</strong> — Carbs spike insulin. Zero-carb keeps insulin low and stable.</li>\n<li><strong>Significant weight to lose</strong> — Zero-carb makes appetite control easier. Adding carbs can trigger cravings.</li>\n<li><strong>Gut issues (IBS, SIBO, Crohn's)</strong> — Fiber and fructose can feed bad bacteria. Strict carnivore starves them out.</li>\n</ul>\n</div>\n</div>\n<!-- Nuanced Take -->\n<div class=\"nuanced-box\">\n<h3>The Nuanced Take</h3>\n<p>Here's what I think is actually happening:</p>\n<p><strong>The debate isn't really about science. It's about individual response.</strong> Some people thrive on zero-carb. Some people do better with a little fruit. Both can work.</p>\n<p>Paul Saladino is a super active guy who surfs and works out constantly. For him, carbs improve performance. <strong>That doesn't mean everyone needs them.</strong></p>\n<p>Shawn Baker is also super active (he's a former pro athlete). He thrives on zero-carb. <strong>That doesn't mean carbs are inherently bad.</strong></p>\n<p>Different people, different results.</p>\n</div>\n<!-- Testing Protocol -->\n<div class=\"testing-box\">\n<h3>How to Figure Out What Works for You</h3>\n<p><strong>If you're new to carnivore, start strict.</strong> Meat, water, salt. Give it 90 days.</p>\n<p>Why? Because you need to establish a baseline. You need to be fully fat-adapted before you can assess whether carbs help or hurt.</p>\n<p>After 90 days, if you're feeling great, keep going. If you're struggling with energy, sleep, or hormones, you can experiment with adding carbs back in.</p>\n<div class=\"testing-steps\">\n<h4>How to Test:</h4>\n<ul>\n<li>Add <strong>one source of carbs</strong> at a time. Honey first, or fruit. Don't add both at once.</li>\n<li>Start small: 1-2 tablespoons of honey, or one piece of fruit per day.</li>\n<li>Track how you feel: energy, sleep, digestion, skin, mood.</li>\n<li>If it helps, keep it. If it causes problems, remove it again.</li>\n</ul>\n</div>\n<p style=\"margin-top: 15px;\"><strong>This is your body. You get to decide what works.</strong></p>\n</div>\n<!-- Bottom Line -->\n<div class=\"bottom-line\">\n<h3>The Bottom Line</h3>\n<p>Paul Saladino isn't wrong. But he's not universally right either.</p>\n<p>For some people, adding honey and fruit improves performance and well-being. For others, it reintroduces cravings, inflammation, and metabolic problems.</p>\n<p>The community is split because <strong>both approaches work for different people.</strong></p>\n<p>If strict carnivore is working for you, you don't need to change. If you're struggling and suspect carbs might help, you can test it without abandoning the core principles: <strong>prioritize animal foods, avoid processed junk, listen to your body.</strong></p>\n<p><em>That's the real lesson here. There's no one perfect protocol. There's only what works for you.</em></p>\n</div>\n<div class=\"key-takeaways\">\n<h3>Key Takeaways</h3>\n<ol>\n<li><strong>Both protocols work</strong>—strict carnivore and animal-based each have success stories</li>\n<li><strong>Paul's argument</strong>—active people may benefit from carbs; honey and fruit are \"clean\" sources</li>\n<li><strong>Strict carnivore argument</strong>—you don't need carbs if fat-adapted; sugar is sugar</li>\n<li><strong>Athletes and women</strong> may benefit from some carbs; autoimmune and metabolic issues often do better strict</li>\n<li><strong>Start strict for 90 days</strong> to establish a baseline before experimenting</li>\n<li><strong>Test one thing at a time</strong>—add honey OR fruit, not both, and track your response</li>\n<li><strong>The real principle</strong>—prioritize animal foods, avoid processed junk, listen to your body</li>\n</ol>\n</div>\n<p>—Chloe</p>\n<p style=\"font-size: 0.9em; color: #d4a574; margin-top: 30px; padding-top: 20px; border-top: 1px solid #8b4513;\">\n<em>This is community observation, not medical advice. Both strict carnivore and animal-based can work. Consult a healthcare provider before making dietary changes.</em>\n</p>\n\n</div>",
  "backed_up_at": "2026-01-20T16:12:19.099691"
}